hiro22022/ASP3_STM32H747_DISCO/target/stm32h747_discovery_m7/stm32hcube/CM7/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stdio.h"
#include "string.h"
#include "serial.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

// タイマの OnePulse モードを使用する
// どうしても割込みが入ってくれないようなので、あきらめる
// #define OnePulseF401

// Disable & Enable Update Interrupt
#define __HAL_TIM_UDIS_DISABLE(__HANDLE__)  ((__HANDLE__)->Instance->CR1|=TIM_CR1_UDIS)
#define __HAL_TIM_UDIS_ENABLE(__HANDLE__)  ((__HANDLE__)->Instance->CR1&=~TIM_CR1_UDIS)

#define TIM_CLK  TIM5
#define TIM_CLK_IRQNO  TIM5_IRQn
#define TIM_CLK_IRQHandler  TIM5_IRQHandler
#define COUNT_BASE 1000
uint32_t  tim_clk_count;

#ifndef HSEM_ID_0
#define HSEM_ID_0 (0U) /* HW semaphore 0*/
#endif
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

extern TIM_HandleTypeDef Tim2Handle;
extern TIM_HandleTypeDef Tim5Handle;
#define htim2 Tim2Handle
#define htim_clk Tim5Handle

UART_HandleTypeDef huart1;

/*---------------------------------------*/
int   b_sta_ker;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/*---------------------------------------------*/
#include "stm32h747xx.h"
#include "stm32h7xx_hal_gpio.h"

/* LED 番号 LED1～LED4 */
typedef enum  {
    LED1 = 0, LED2, LED3, LED4
} LED_Index;

/* LED 構成構造体 */
typedef struct {
    GPIO_TypeDef  *gpio;
    uint32_t      Pin;
} LED_conf;

/* LED1～LED4 の構成 */
const LED_conf led_conf[] =
{
    { GPIOI, GPIO_PIN_12 },      /* LED1 */
    { GPIOI, GPIO_PIN_13 },      /* LED2 */
    { GPIOI, GPIO_PIN_14 },      /* LED3 */
    { GPIOI, GPIO_PIN_15 },      /* LED4 */
};

/* LED の初期化 */
void led_init()
{
    uint32_t temp;
    int  i;

    /* RCC (クロック) の設定 */
    RCC_TypeDef  *rcc = RCC;
    temp = rcc->AHB4ENR;
    temp |= RCC_AHB4ENR_GPIOIEN;
    rcc->AHB4ENR = temp;

    /* GPIO コントロールレジスタの設定 */
    GPIO_InitTypeDef gpio_init;
    gpio_init.Mode      = GPIO_MODE_OUTPUT_OD;
    gpio_init.Pull      = GPIO_NOPULL;
    gpio_init.Speed     = GPIO_SPEED_FREQ_HIGH;
    gpio_init.Alternate = 0x0;
    for( i = LED1; i <= LED4; i++ ){
        gpio_init.Pin   = led_conf[ i ].Pin;
        HAL_GPIO_Init( led_conf[ i ].gpio, &gpio_init );
    }
}

void led_on( uint32_t no )
{
    if( no <= LED4 )
        HAL_GPIO_WritePin( led_conf[no].gpio, led_conf[no].Pin, GPIO_PIN_RESET );
}

void led_off( uint32_t no )
{
    if( no <= LED4 )
        HAL_GPIO_WritePin( led_conf[no].gpio, led_conf[no].Pin, GPIO_PIN_SET );
}

void led_set( int val )
{
    /* LED が同じ GPIO で並んでいることを利用して、１回の IO アクセスでよいように効率化したバージョン */
    uint32_t rs_val = 0;
    int i;
    for( i = LED1; i <= LED4; i++ ){
      if( val & ( 1 << i ) )
        rs_val |= 1 << (i+12+16);
      else
        rs_val |= 1 << (i+12);
    }
    /* GPIO のレジスタに直接書き込む */
    led_conf[0].gpio->BSRR = rs_val;
}

void
led_blink( int i, int j )
{
  int  n;
  while(1){
    for( n = 0; n < 100000; n++ ){
      led_set(i);
    }
    for( n = 0; n < 100000; n++ ){
      led_set(j);
    }
  }

}
/*---------------------------------------------*/

/*
 *  受信バッファに文字があるか？
 */
static bool_t
usart_getready()
{
	return (USART1->ISR & USART_ISR_RXNE_RXFNE) != 0;
}

/*
 *  送信バッファに空きがあるか？
 */
static bool_t
usart_putready()
{
	return (USART1->ISR & USART_ISR_TXE_TXFNF) != 0;
}

/*
 *  受信した文字の取出し
 */
static char
usart_getchar()
{
	return (char)(USART1->RDR);
}

/*
 *  送信する文字の書込み
 */
static void
usart_putchar(char c)
{
	(USART1->TDR) = (uint32_t)(uint8_t)c;
}

static void ciSIOCBR_readyReceive();
static void ciSIOCBR_readySend();

static void
usart_ISRHandler(void)
{

	if (usart_getready()) {
		/*
		 *  受信通知コールバックルーチンを呼び出す．
		 */
		ciSIOCBR_readyReceive();
	}
	if (usart_putready()) {
		/*
		 *  送信可能コールバックルーチンを呼び出す．
		 */
		ciSIOCBR_readySend();
	}
}

static void
usart_ena_txint(void)
{
	// UART_IT_TXE CR1 bit 7
	USART1->CR1 |= USART_CR1_TXEIE_TXFNFIE;
}

static void
usart_ena_rxint(void)
{
   // UART_IT_RXNE CR1 bit 5
	USART1->CR1 |= USART_CR1_RXNEIE_RXFNEIE;
}

static void
usart_dis_txint(void)
{
	// UART_IT_TXE CR1 bit 7
	USART1->CR1 &= ~USART_CR1_TXEIE_TXFNFIE;
}

static void
usart_dis_rxint(void)
{
   // UART_IT_RXNE CR1 bit 5
	USART1->CR1 &= ~USART_CR1_RXNEIE_RXFNEIE;
}

static char
usart_getchar_block()
{
  while( usart_getready() == 0 ) {}
 	return usart_getchar();
}

static void
usart_puts( char *s)
{
  while(*s){
    while(!usart_putready()) ;
    usart_putchar(*s++);
  }
}

/*---------------------------------------------*/
#define SIO_BUF_LEN   256
char  sio_send_buf[ SIO_BUF_LEN ];
volatile  int  sio_send_buf_wp;
volatile  int  sio_send_buf_rp;

